<a href="https://colab.research.google.com/github/aptr288/Python_Toolbox/blob/master/Pandas_Operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#reference https://www.w3resource.com/python-exercises/pandas/index-dataframe.php
import pandas as pd
import numpy as np
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df.pow(2))
newDf = df ** 2
print(newDf)

      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889
      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

# #Initializing data frame with dictionary

In [2]:
import pandas as pd

dictdata = {'Match':[1,2,3,4,5,6],'Players':['Ind','Pak','Eng','SA','WI','Ban'] }
data = pd.DataFrame(dictdata)
print(data)
print("Summary of the basic information about this DataFrame and its data:")
print(data.info())

   Match Players
0      1     Ind
1      2     Pak
2      3     Eng
3      4      SA
4      5      WI
5      6     Ban
Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
Match      6 non-null int64
Players    6 non-null object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes
None

In [71]:
import pandas as pd
import numpy as np

exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

# Select multiple Columns

In [5]:
#select the 'name' and 'score' columns, we creat LIST of COLUMN names for selecting specific columns
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

# Slicing DataFrame
Pandas program to get the first 3 rows of a given DataFrame

In [3]:
#loc for EXPLICIT indexing So we get 3 Rows and all columns
print(data.loc[0:2, :])
#iloc for IMPLICIT indexing with 3 rows and One column
print(data.iloc[0:3, 0:1])

   Match Players
0      1     Ind
1      2     Pak
2      3     Eng
   Match
0      1
1      2
2      3

Select the specified columns and rows

In [8]:
print(df[['name','score']].iloc[0:3])
df.iloc[[1, 3, 5, 6], [1, 3]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

# Select the rows with Specific Conditions
where the number of attempts in the examination is greater than 2

In [10]:
print(df)
df[df['attempts']>2]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

#Count the number of rows and columns

In [17]:
#Axes 0 is for ROWS and Axes 1 for columns 
total_rows=len(df.axes[0])
total_cols=len(df.axes[1])
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

Number of Rows: 10
Number of Columns: 4

Select the **rows** where the score is missing, i.e. is **NaN**

In [28]:
#NOT WORKING
# import numpy as np
# df[df['score'] == np.NAN]
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [41]:
#Wrong trials 
#df[df['score'] >= 15 and df['score'] <=20]
#df[df['score'] >= 15 & df['score'] <=20]
#The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().
#Right procedures
print(df[(df['score'] >= 15) & (df['score'] <=20)])
#in built method
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [43]:
#Normally we use "and" for and operaton but as we can see up we are replacing it with "&" inside bracket of dataframe  
i = 10
j = 89
if(i > 5 and j < 100):
  print("Yes")

Yes

Select the rows where number of **attempts** in the **examination** is **less than 2** and **score greater than 15**

In [44]:
df[(df['score'] > 15) & (df['attempts'] <2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Change the **score** in **row 'd'** to **11.5**

In [48]:
df['score'].loc['d'] = 11.5
# even it can be written as 
#df.loc['d', 'score'] = 11.5
df

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [50]:
print("\nSum of the examination attempts by the students:")
print(df['attempts'].sum())

Sum of the examination attempts by the students:
19

Calculate the **mean** score for **each different student** in DataFrame

In [56]:
df.groupby('name')['score','attempts'].mean()

           score  attempts
name
Anastasia   12.5         1
Dima         9.0         3
Emily        9.0         2
James       11.5         3
Jonas       19.0         1
Katherine   16.5         2
Kevin        8.0         2
Laura        NaN         1
Matthew     14.5         1
Michael     20.0         3

# Add **new** row 'k' to data frame with given values for each column.

In [72]:
#name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
print(df)
#Wrong trails
#df.append(name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k")
#df.loc['k']= [name : "Suresh", score: 15.5, attempts: 1, qualify: "yes"]    invalid syntax
df.loc['k'] = ["Suresh", 15.5, 1, "Yes"]
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     Yes

# Delete the row from DataFrame

In [73]:
print("\nDelete the new row and display the original  rows:")
df = df.drop('k')
print(df)

Delete the new row and display the original  rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Sorting

In [77]:
df.sort_values(by=['name', 'score'], ascending=[False, True])
print("Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:")
print(df)
df.sort_values('name')

Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James    NaN         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

Better reference for multiple columns
https://www.geeksforgeeks.org/python-pandas-dataframe-sort_values-set-2/

# Replace 
The '**qualify**' column contains the values '**yes**' and '**no**' with **True** and **False**.

In [104]:
import pandas as pd
import numpy as np

exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)

# print("\nReplace the ‘qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [105]:

df['qualify'] = df['qualify'].map({True : 'yes',  False :'no'})
print(df)
#raw method whcih i have done 
df['qualify'] = df['qualify'].replace('yes','True')
df['qualify'] = df['qualify'].replace('no','False')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

In [106]:
print("\nChange the name 'James' to ‘Suresh’:")
df['name'] = df['name'].replace('James', 'Suresh')
print(df)

Change the name 'James' to ‘Suresh’:
        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d     Suresh    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

# Delete the column

In [110]:
#Inserting a temp column for deleting it 
df['NewTempCol'] = 1
print(df)
del df['NewTempCol']
df

#df.pop('attempts') will also work

        name  score  attempts qualify  NewTempCol
a  Anastasia   12.5         1    True           1
b       Dima    9.0         3   False           1
c  Katherine   16.5         2    True           1
d     Suresh    NaN         3   False           1
e      Emily    9.0         2   False           1
f    Michael   20.0         3    True           1
g    Matthew   14.5         1    True           1
h      Laura    NaN         1   False           1
i      Kevin    8.0         2   False           1
j      Jonas   19.0         1    True           1

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d     Suresh    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

# Insert New Column

In [112]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1    True     Red
b       Dima    9.0         3   False    Blue
c  Katherine   16.5         2    True  Orange
d     Suresh    NaN         3   False     Red
e      Emily    9.0         2   False   White
f    Michael   20.0         3    True   White
g    Matthew   14.5         1    True    Blue
h      Laura    NaN         1   False   Green
i      Kevin    8.0         2   False   Green
j      Jonas   19.0         1    True     Red